/*******************************************************************************
 * Includes
*******************************************************************************/
#include <stdio.h>
#include <stdint.h>

/*******************************************************************************
 * Code
*******************************************************************************/
/**
 * \brief 32位寄存器写函数
 */
__attribute__((weak)) void usb_reg_writel(uint32_t val, volatile void *p_addr){
}

/**
 * \brief 32位寄存器读函数
 */
__attribute__((weak)) uint32_t usb_reg_readl(volatile void *p_addr){
    return 0;
}

